common-sign-impl/src/test/resources/ru/i_novus/common/sign/test/smev/getRequestRequest.xml

<!--
  -----------------------------------------------------------------
  common-sign-gost
  -----------------------------------------------------------------
  Copyright (C) 2018 - 2019 I-Novus LLC
  -----------------------------------------------------------------
  Licensed under the Apache License, Version 2.0 (the "License");
  you may not use this file except in compliance with the License.
  You may obtain a copy of the License at
  
       http://www.apache.org/licenses/LICENSE-2.0
  
  Unless required by applicable law or agreed to in writing, software
  distributed under the License is distributed on an "AS IS" BASIS,
  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  See the License for the specific language governing permissions and
  limitations under the License.
  -----------------------------------------------------------------
  -->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns2:GetRequestRequest xmlns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.2"
                               xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.2">
            <MessageTypeSelector Id="SIGNED_BY_CALLER">
                <NamespaceURI>http://egisz.rosminzdrav.ru/smev/iehr/GetArchivedMedicalDocuments/1.0.2</NamespaceURI>
                <RootElementLocalName>InputData</RootElementLocalName>
                <Timestamp>2018-09-20T16:22:14.058+03:00</Timestamp>
            </MessageTypeSelector>
        </ns2:GetRequestRequest>
    </soap:Body>
</soap:Envelope>
